wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_SetQuadEnable(spim,
                       ((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                        (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? 1 : 0,
                       1);

    SPIM_DISABLE_DMM_BWEN(spim);
    SPIM_DISABLE_DMM_CREN(spim);

    /* Set Flash Command Phase */
    SPIM_DMADMM_SetCMDPhase(spim,
                            u32OPMode,
                            psPhaseTable->u32CMDPhase,
                            psPhaseTable->u32CMDWidth,
                            psPhaseTable->u32CMDDTR);

    /* Set Flash Address Phase */
    SPIM_DMADMM_SetAddrPhase(spim,
                             u32OPMode,
                             psPhaseTable->u32AddrPhase,
                             psPhaseTable->u32AddrWidth,
                             psPhaseTable->u32AddrDTR);

    /* Set DMA/DMM Continue Read Phase */
    SPIM_DMADMM_SetContReadPhase(spim,
                                 u32OPMode,
                                 psPhaseTable->u32RdModePhase,
                                 psPhaseTable->u32RdModeWidth,
                                 psPhaseTable->u32ContRdEn,
                                 psPhaseTable->u32RdModeDTR);

    if (psPhaseTable->u32DataPhase == PHASE_OCTAL_MODE)
    {
        u32RDQSOn = 1;
    }

    /* Set Flash Data Phase */
    SPIM_DMADMM_SetDataPhase(spim,
                             u32OPMode,
                             psPhaseTable->u32DataPhase,
                             psPhaseTable->u32ByteOrder,
                             u32RDQSOn,
                             psPhaseTable->u32DataDTR);

    /* Set Dummy Cycle After Address. */
    if (u32OPMode == SPIM_CTL0_OPMODE_PAGEREAD)
    {
        SPIM_SET_DMAR_DC(spim, psPhaseTable->u32DcNum);
    }
    else if (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)
    {
        SPIM_SET_DMM_DC(spim, psPhaseTable->u32DcNum);
    }
}

/**
 * @brief Normal I/O mode data phase.
 *
 * @param spim
 * @param u32OPMode     Normal I/O read or wirte mode.
 *                      - \ref SPIM_IO_WRITE_PHASE
 *                      - \ref SPIM_IO_READ_PHASE
 * @param pu8TRxBuf     Read/Write Data Buffer
 * @param u32TRxSize    Read/Write Data Size
 * @param u32DataPhase  Data Bit Mode
 *                      - \ref PHASE_NORMAL_MODE : Send data use standard mode.
 *                      - \ref PHASE_DUAL_MODE   : Send data use dual mode.
 *                      - \ref PHASE_QUAD_MODE   : Send data use quad mode.
 *                      - \ref PHASE_OCTAL_MODE  : Send data use octal mode.
 * @param u32DTREn      DTR mode
 *                      - \ref SPIM_OP_ENABLE
 *                      - \ref SPIM_OP_DISABLE
 * @param isSync        sync write done
 *                      - \ref 0 : read mode
 *                      - \ref 1 : write mode and wait write done
 */
void SPIM_IO_SendDataPhase(SPIM_T *spim, uint32_t u32OPMode, uint8_t *pu8TRxBuf,
                           uint32_t u32TRxSize, uint32_t u32CMDPhase,
                           uint32_t u32DataPhase, uint32_t u32DTREn)
{
    SPIM_SET_DTR_MODE(spim, u32DTREn);              /* DTR Activated. */
    //SPIM_SET_RDQS_MODE(spim, u32DTREn);

    if (u32OPMode == SPIM_IO_WRITE_PHASE)
    {
        SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32DataPhase));
        spim_write(spim, pu8TRxBuf, u32TRxSize);     /* Write out data.  */
    }
    else
    {
        SwitchNBitInput(spim, SPIM_GetIOPhaseSize(u32DataPhase));
        spim_read(spim, pu8TRxBuf, u32TRxSize);      /* Read back data.  */
    }

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);          /* CS Deactivated. */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);       /* DTR Deactivated. */
    SPIM_SET_RDQS_MODE(spim, SPIM_OP_DISABLE);

    if ((u32OPMode == SPIM_IO_WRITE_PHASE) && (u32TRxSize > 1))
    {
        SPIM_Wait_Write_Done(spim, SPIM_GetIOPhaseSize(u32CMDPhase));
    }
}

/**
 * @brief Normal I/O mode send dummy cycle clocks.
 *
 * @param spim
 * @param u32NDummy dummy clocks, reference SPI flash command specification
 * @return int32_t
 */
int32_t SPIM_IO_SendDummyCycle(SPIM_T *spim, int u32NDummy)
{
    if (u32NDummy == 0)
    {
        return SPIM_OK;
    }

    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);       /* DTR Deactivated. */
    SwitchNBitOutput(spim, 1);
    spim->TX[0] = 0x00;

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);     /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, u32NDummy);
    SPIM_SET_BURST_DATA(spim, 1UL);

    if (SPIM_WaitSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
 * @brief   Normal I/O mode send address phase
 *
 * @param spim
 * @param u32Is4ByteAddr    SPI Flash 4 Bytes Address
 * @param u32Addr           Read/Write start addess
 * @param u32AddrPhase      Address Bit Mode
 *                          - \ref PHASE_NORMAL_MODE : Send address use standard mode.
 *                          - \ref PHASE_DUAL_MODE   : Send address use dual mode.
 *                          - \ref PHASE_QUAD_MODE   : Send address use quad mode.
 *                          - \ref PHASE_OCTAL_MODE  : Send address use octal mode.
 * @param u32DTREn          Double Data Rate
 *                          - \ref SPIM_OP_ENABLE
 *                          - \ref SPIM_OP_DISABLE
 */
void SPIM_IO_SendAddrPhase(SPIM_T *spim,
                           uint32_t u32Is4ByteAddr,
                           uint32_t u32Addr,
                           uint32_t u32AddrPhase,
                           uint32_t u32DTREn)
{
    uint8_t u8CmdBuf[8] = {0};
    uint8_t u8BufIdx = 0;

    SPIM_SET_DTR_MODE(spim, u32DTREn); /* DTR Activated. */

    if (u32Is4ByteAddr)
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 24);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
        u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;
    }
    else
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
        u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;
    }

    if ((SPIM_GetIOPhaseSize(u32AddrPhase) == 2) ||
            (SPIM_GetIOPhaseSize(u32AddrPhase) == 4))
    {
        u8BufIdx++;
    }

