wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32AddrPhase));
    spim_write(spim, u8CmdBuf, u8BufIdx);       /* Write out u32Address. */

    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);   /* DTR Deactivated. */
}

/**
 * @brief Normal I/O mode sends commands phase.
 *
 * @param spim
 * @param u32OPMode     Normal I/O read or wirte mode.
 *                      - \ref SPIM_IO_WRITE_PHASE
 *                      - \ref SPIM_IO_READ_PHASE
 * @param u32OpCMD      Read/Write Command reference SPI Flash specification.
 * @param u32CMDPhase   Command Bit Mode
 *                      - \ref PHASE_NORMAL_MODE : Send address use standard mode.
 *                      - \ref PHASE_DUAL_MODE   : Send address use dual mode.
 *                      - \ref PHASE_QUAD_MODE   : Send address use quad mode.
 *                      - \ref PHASE_OCTAL_MODE  : Send address use octal mode.
 * @param u32DTREn      Double data rate
 *                      - \ref SPIM_OP_ENABLE
 *                      - \ref SPIM_OP_DISABLE
 */
void SPIM_IO_SendCMDPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32OpCMD,
                          uint32_t u32CMDPhase, uint32_t u32DTREn)
{
    uint8_t u8CmdBuf[2] = {0};
    uint8_t u8CmdSize = 1UL;

    if (u32OPMode == SPIM_IO_WRITE_PHASE)
    {
        /* Write Enable. */
        SPIM_Set_Write_Enable(spim, 1, SPIM_GetIOPhaseSize(u32CMDPhase));
    }

    SPIM_SET_DTR_MODE(spim, u32DTREn);          /* DTR Activated. */

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);       /* CS activated. */

    u8CmdBuf[0] = (u32OpCMD & 0xFF);

    if (u32DTREn == 1)
    {
        u8CmdBuf[1] = (u32OpCMD & 0xFF);
        u8CmdSize = 2UL;
    }

    SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32CMDPhase));

    spim_write(spim, u8CmdBuf, u8CmdSize);      /* Write out command. */

    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);   /* DTR Deactivated. */
}


void SPIM_WriteInPageDataByPhaseIO(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable,
                                   uint32_t u32Addr, int is4ByteAddr,
                                   uint8_t *pu8TxBuf, uint32_t u32RdSize)
{
    SPIM_IO_SendCMDPhase(spim,
                         SPIM_IO_WRITE_PHASE,
                         psPhaseTable->u32CMDCode,
                         psPhaseTable->u32CMDPhase,
                         psPhaseTable->u32CMDDTR);

    SPIM_IO_SendAddrPhase(spim,
                          is4ByteAddr,
                          u32Addr,
                          psPhaseTable->u32AddrPhase,
                          psPhaseTable->u32AddrDTR);

    /* Write out dummy bytes. */
    SPIM_IO_SendDummyCycle(spim, psPhaseTable->u32DcNum);

    SPIM_IO_SendDataPhase(spim,
                          SPIM_IO_WRITE_PHASE,
                          pu8TxBuf,
                          u32RdSize,
                          psPhaseTable->u32CMDPhase,
                          psPhaseTable->u32DataPhase,
                          psPhaseTable->u32DataDTR);
}

void SPIM_IO_WritePhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable,
                        uint32_t u32Addr, uint8_t *pu8TxBuf, uint32_t u32WrSize)
{
    uint32_t u32PageOffset;
    uint32_t u32BufIdx = 0UL;
    uint32_t u32Is4ByteAddr = 0;

    if (psPhaseTable->u32AddrWidth == PHASE_WIDTH_32)
    {
        u32Is4ByteAddr = 1;
    }
    else
    {
        u32Is4ByteAddr = 0;
    }

    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, 1, 0);
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    SPIM_SetQuadEnable(spim,
                       ((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                        (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? 1 : 0,
                       1);

    u32PageOffset = u32Addr % 256UL;

    if ((u32PageOffset + u32WrSize) <= 256UL)          /* Do all the bytes fit onto one page ? */
    {
        SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32Addr, u32Is4ByteAddr, &pu8TxBuf[u32BufIdx], u32WrSize);
    }
    else
    {
        uint32_t toWr = 256UL - u32PageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32Addr, u32Is4ByteAddr, &pu8TxBuf[u32BufIdx], toWr);
        u32Addr += toWr;                         /* Advance indicator.  */
        u32WrSize -= toWr;
        u32BufIdx += toWr;

        while (u32WrSize)
        {
            toWr = 256UL;

            if (toWr > u32WrSize)
            {
                toWr = u32WrSize;
            }

            SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32Addr, u32Is4ByteAddr, &pu8TxBuf[u32BufIdx], toWr);
            u32Addr += toWr;                 /* Advance indicator.  */
            u32WrSize -= toWr;
            u32BufIdx += toWr;
        }
    }

    SPIM_SetQuadEnable(spim, 0, 1);
}

/**
  * @brief      Read data from SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr     Start u32Address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32RdSize   Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      rdCmd       Read command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      u32NDummy   Number of dummy bytes following address.
  * @param      u32DTREn    DTR mode
  *                         - \ref SPIM_OP_ENABLE
  *                         - \ref SPIM_OP_DISABLE
  * @return     None.
  */

/**
 * @brief
 *
 * @param spim          Read data from SPI Flash by use phase table (I/O mode).
 * @param psPhaseTable  Check SPI Flash specifications for support command codes,
 *                      and create command phase table.
 * @param u32Addr       Read start address
 * @param pu8RxBuf      Data buffer
 * @param u32RdSize     Read data size
 */
void SPIM_IO_ReadPhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable,
                       uint32_t u32Addr, uint8_t *pu8RxBuf, uint32_t u32RdSize)
{
    uint32_t u32Is4ByteAddr = 0;

    if (psPhaseTable->u32AddrWidth == PHASE_WIDTH_32)
    {
        u32Is4ByteAddr = 1;
    }
    else
    {
        u32Is4ByteAddr = 0;
    }

    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, 1, 0);
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

