wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_SetQuadEnable(spim,
                       ((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                        (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? 1 : 0,
                       1);

    SPIM_IO_SendCMDPhase(spim,
                         SPIM_IO_READ_PHASE,
                         psPhaseTable->u32CMDCode,
                         psPhaseTable->u32CMDPhase,
                         psPhaseTable->u32CMDDTR);

    SPIM_IO_SendAddrPhase(spim,
                          u32Is4ByteAddr,
                          u32Addr,
                          psPhaseTable->u32AddrPhase,
                          psPhaseTable->u32AddrDTR);

    /* Write out dummy bytes. */
    SPIM_IO_SendDummyCycle(spim, psPhaseTable->u32DcNum);

    SPIM_IO_SendDataPhase(spim,
                          SPIM_IO_READ_PHASE,
                          pu8RxBuf,
                          u32RdSize,
                          psPhaseTable->u32CMDPhase,
                          psPhaseTable->u32DataPhase,
                          psPhaseTable->u32DataDTR);

    SPIM_SetQuadEnable(spim, 0, 1);
}

/**
  * @brief      Write data to SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @return     None.
  */
void SPIM_IO_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                   uint32_t u32NTx, uint8_t *pu8TxBuf, uint8_t wrCmd,
                   uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat,
                   uint32_t u32DTREn)
{
    uint32_t  pageOffset;
    uint32_t  buf_idx = 0UL;

    pageOffset = u32Addr % 256UL;

    if ((pageOffset + u32NTx) <= 256UL)          /* Do all the bytes fit onto one page ? */
    {
        SPIM_WriteInPageDataByIO(spim, u32Addr, is4ByteAddr, u32NTx, &pu8TxBuf[buf_idx],
                                 wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, u32DTREn, 1);
    }
    else
    {
        uint32_t toWr = 256UL - pageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByIO(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx],
                                 wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, u32DTREn, 1);
        u32Addr += toWr;                         /* Advance indicator.  */
        u32NTx -= toWr;
        buf_idx += toWr;

        while (u32NTx)
        {
            toWr = 256UL;

            if (toWr > u32NTx)
            {
                toWr = u32NTx;
            }

            SPIM_WriteInPageDataByIO(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx],
                                     wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, u32DTREn, 1);
            u32Addr += toWr;                 /* Advance indicator.  */
            u32NTx -= toWr;
            buf_idx += toWr;
        }
    }
}

/**
  * @brief      Read data from SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr     Start u32Address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NRx      Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      rdCmd       Read command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      u32NDummy   Number of dummy bytes following address.
  * @param      u32DTREn    Double Data Rate Mode
  *                         - \ref SPIM_OP_ENABLE
  *                         - \ref SPIM_OP_DISABLE
  * @return     None.
  */
void SPIM_IO_Read(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NRx, uint8_t *pu8RxBuf, uint8_t rdCmd,
                  uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, int u32NDummy, uint32_t u32DTREn)
{
    uint8_t   cmdBuf[16];
    uint32_t  buf_idx;

    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */

    cmdBuf[0] = rdCmd;
    SwitchNBitOutput(spim, u32NBitCmd);
    spim_write(spim, cmdBuf, 1UL);                    /* Write out command. */

    buf_idx = 0UL;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }

    /* Add a byte for the address phase for dual or quad mode for read mode */
    if ((u32NBitAddr == 2) ||
            (u32NBitAddr == 4))
    {
        buf_idx++;
    }

    SPIM_SET_DTR_MODE(spim, u32DTREn);                  /* DTR Activated. */
    SwitchNBitOutput(spim, u32NBitAddr);
    spim_write(spim, cmdBuf, buf_idx);                 /* Write out u32Address. */

    //buf_idx = 0UL;

    //while (u32NDummy--)
    //{
    //    cmdBuf[buf_idx++] = 0x00U;
    //}

    /* Same bit mode as above. */
    //spim_write(spim, cmdBuf, buf_idx);                 /* Write out dummy bytes. */
    SPIM_IO_SendDummyCycle(spim, u32NDummy);           /* Write out dummy bytes. */

    SPIM_SET_DTR_MODE(spim, u32DTREn);                 /* DTR Activated. */
    SwitchNBitInput(spim, u32NBitDat);
    spim_read(spim, pu8RxBuf, u32NRx);                 /* Read back data.  */

    SPIM_SET_SS_EN(spim, 0);                           /* CS deactivated.  */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);          /* DTR Activated. */
}

/**
  * @brief      Write data to SPI Flash by Page Write mode.
  * @param      u32Addr     Start address to write.
  * @param      is4ByteAddr 4-byte address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @return     None.
  *
  * @note       Before calling this API, must first call SPIM_DMADMM_InitPhase to set PHDMAW.
  */
void SPIM_DMA_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                    uint32_t u32NTx, uint8_t *pu8TxBuf, uint32_t wrCmd)
{
    uint32_t pageOffset;

    /* DTR mode and 16-bit set to dual commands */
    if ((SPIM_GET_PHDMAW_CMD_WIDTH(spim) == PHASE_WIDTH_16) &&
            (SPIM_GET_PHDMAW_CMD_DTR(spim) == 1))
    {
        wrCmd = ((wrCmd << 8) | wrCmd);
    }

